Client/Solution/Externals/TestFiles/SoapTests/message3.expected

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<getAirportInformationByCityOrAirportName xmlns="http://www.webserviceX.NET">
<cityOrAirportName>Moscow Domodedovo</cityOrAirportName>
</getAirportInformationByCityOrAirportName>
</soap:Body>
</soap:Envelope>