soap/target/test-classes/airport.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<GetAirportInformationByCountry xmlns="http://www.webserviceX.NET">
			<country>china</country>
		</GetAirportInformationByCountry>
	</soap:Body>
</soap:Envelope>