Demo-Java-Automation-api_SOAP/src/main/resources/xml/airPortCode/GetInfoByAPCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getAirportInformationByAirportCode>
         <!--Optional:-->
         <web:airportCode>?</web:airportCode>
      </web:getAirportInformationByAirportCode>
   </soapenv:Body>
</soapenv:Envelope>