Client/Solution/Externals/TestFiles/HttpTests/request2.example

POST /airport.asmx HTTP/1.1
Host: www.webservicex.net
Content-Type: text/xml; charset=utf-8
Content-Length: 385

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<GetAirportInformationByCountry xmlns="http://www.webserviceX.NET">
<country>Canada</country>
</GetAirportInformationByCountry>
</soap:Body>
</soap:Envelope>