resources/airport.xml

<testsuite>
<testcase>
<name>TC_001</name>
	<request>
		
		<!-- RAW request Content -->
		<content>
		<![CDATA[
		<?xml version='1.0' encoding='UTF-8'?>
      <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.webserviceX.NET">
   <soap:Header/>
   <soap:Body>
      <web:GetAirportInformationByCountry>
         <!--Optional:-->
         <web:country>sri lanka</web:country>
      </web:GetAirportInformationByCountry>
   </soap:Body>
</soap:Envelope>
		]]>
		</content>
	</request>
	<verify>
	<!-- Iterate one or many-->
		<param><![CDATA[MINNERIYA]]></param>
		
	</verify>
	<verifynegative>
	<!-- Iterate Zero or many-->
		<param><![CDATA[
		error
		]]></param>
	</verifynegative>
	
</testcase>

</testsuite>